In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({
    'name': ['Bode','Jammal','Dami','Dami','Josh','Jimi','Alan','Alan'],
    'score': [37,38,38,38,39,50,40,40]
})
print(df)

     name  score
0    Bode     37
1  Jammal     38
2    Dami     38
3    Dami     38
4    Josh     39
5    Jimi     50
6    Alan     40
7    Alan     40

In [6]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
dtype: bool

In [7]:
df.drop_duplicates()

     name  score
0    Bode     37
1  Jammal     38
2    Dami     38
4    Josh     39
5    Jimi     50
6    Alan     40

In [9]:
#dropping duplicate based on a specific column
df.drop_duplicates(['score'])

     name  score
0    Bode     37
1  Jammal     38
4    Josh     39
5    Jimi     50
6    Alan     40

In [10]:
df.drop_duplicates(['score'],keep='last' )

   name  score
0  Bode     37
3  Dami     38
4  Josh     39
5  Jimi     50
7  Alan     40